Revit 2026 API

# AssemblyMemberDifferentCategory Class

---

The two assembly members being compared have different category

SystemObject Autodesk.Revit.DBAssemblyMemberDifference Autodesk.Revit.DBAssemblyMemberDifferentCategory

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyMemberDifferentCategory : AssemblyMemberDifference
```
```vb
Public Class AssemblyMemberDifferentCategory
	Inherits AssemblyMemberDifference
```
```cpp
public ref class AssemblyMemberDifferentCategory : public AssemblyMemberDifference
```
```fsharp
type AssemblyMemberDifferentCategory =
    class
        inherit AssemblyMemberDifference
    end
```

The AssemblyMemberDifferentCategory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId1 | Category id of the first assembly member |
|  | CategoryId2 | Category id of the second assembly member |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyMemberDifference) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from AssemblyMemberDifference) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace